package lottoTeam3;

public class _Notice {
	// 7월 29일 1차 배포 피드백
//	## 발견된 버그
//	 1. 프로그램을 종료하여도, 번호 선택 대화상자가 사라지지 않아요.
//	 2. 번호 선택 시(수정 버튼 눌렀을 때), 번호가 자동 선택되어 화면에 바로 표시되는 경우가 있음
//
//	## 건의 사항
//	 1. 번호 선택 대화상자에서, 실수로 선택된 번호 하나를 선택 취소 하고 싶어요.
	
	// 7월 30일 오전 9시 1차 배포 피드백 모두 완료 
	//	7월 30일 오후 2시 2차 배포
//	## 건의 사항
//	 1. 번호 수정 시, 기존 번호가 사라져요.
//	 2. 각 게임의 일치한 번호를 확인할 수 있었으면 좋겠어요.
//	 3. 각 게임의 자동/수동/반자동 선택을 알고 싶어요.
//	 4. 결과창의 위치가 너무 먼 곳에 보여요.
//
//	## 문의 사항
//	 1. 모두 자동으로 1장 바로 구매할 순 없나요? 
	
//	오후 5시
//	건의사항 1번 2번 4번 해결, 문의사항 1번 해결
//	건의사항 3번 예은이 수정은 반영 그에 맞춰서 학석이랑 강호가 조금의 더 수정 필요
	
//	오후 6시
//	건의사항 3번 해결(enum클래스 mode추가)
	
	// 7월 31일 아침 잔업 병합
//	오전 10시 30분 모든 코드 전체 검토, 코드 리팩토링 작업 분배
//	2. 현재 선택하고 있는 개수를 파악하기 힘든데, 6개 초과 선택 시에는 대화상자가 선택을 방해해서 불편해요.
//	새로 나온 건의 사항 적용 필요
//	오후 12시 13분 강호 작업(리팩토링, 로또 숫자에 맞춘 사이즈 조절 등등) 마스터에 병합
//	오후 3시문의사항 2번(6개 초과 선택 시에는 대화상자가 선택을 방해해서 불편해요.) 해결 후 병합
	
	
		
}
